zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mlb.h
#define MLB_MS1_MCS_Pos                       (0)                                            /**< (MLB_MS1) MediaLB Channel Status [63:32] (cleared by writing a 0) Position */
#define MLB_MS1_MCS_Msk                       (0xFFFFFFFFU << MLB_MS1_MCS_Pos)               /**< (MLB_MS1) MediaLB Channel Status [63:32] (cleared by writing a 0) Mask */
#define MLB_MS1_MCS(value)                    (MLB_MS1_MCS_Msk & ((value) << MLB_MS1_MCS_Pos))
#define MLB_MS1_Msk                           (0xFFFFFFFFUL)                                 /**< (MLB_MS1) Register Mask  */

/* -------- MLB_MSS : (MLB Offset: 0x20) (R/W 32) MediaLB System Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RSTSYSCMD:1;               /**< bit:      0  Reset System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t LKSYSCMD:1;                /**< bit:      1  Network Lock System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t ULKSYSCMD:1;               /**< bit:      2  Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t CSSYSCMD:1;                /**< bit:      3  Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t SWSYSCMD:1;                /**< bit:      4  Software System Command Detected in the System Quadlet (cleared by writing a 0) */
    uint32_t SERVREQ:1;                 /**< bit:      5  Service Request Enabled                       */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __MLB_MSS_bits_t;

#define MLB_MSS_RSTSYSCMD_Pos                 (0)                                            /**< (MLB_MSS) Reset System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_RSTSYSCMD_Msk                 (0x1U << MLB_MSS_RSTSYSCMD_Pos)                /**< (MLB_MSS) Reset System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_LKSYSCMD_Pos                  (1)                                            /**< (MLB_MSS) Network Lock System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_LKSYSCMD_Msk                  (0x1U << MLB_MSS_LKSYSCMD_Pos)                 /**< (MLB_MSS) Network Lock System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_ULKSYSCMD_Pos                 (2)                                            /**< (MLB_MSS) Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_ULKSYSCMD_Msk                 (0x1U << MLB_MSS_ULKSYSCMD_Pos)                /**< (MLB_MSS) Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_CSSYSCMD_Pos                  (3)                                            /**< (MLB_MSS) Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_CSSYSCMD_Msk                  (0x1U << MLB_MSS_CSSYSCMD_Pos)                 /**< (MLB_MSS) Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_SWSYSCMD_Pos                  (4)                                            /**< (MLB_MSS) Software System Command Detected in the System Quadlet (cleared by writing a 0) Position */
#define MLB_MSS_SWSYSCMD_Msk                  (0x1U << MLB_MSS_SWSYSCMD_Pos)                 /**< (MLB_MSS) Software System Command Detected in the System Quadlet (cleared by writing a 0) Mask */
#define MLB_MSS_SERVREQ_Pos                   (5)                                            /**< (MLB_MSS) Service Request Enabled Position */
#define MLB_MSS_SERVREQ_Msk                   (0x1U << MLB_MSS_SERVREQ_Pos)                  /**< (MLB_MSS) Service Request Enabled Mask */
#define MLB_MSS_Msk                           (0x0000003FUL)                                 /**< (MLB_MSS) Register Mask  */

/* -------- MLB_MSD : (MLB Offset: 0x24) (R/ 32) MediaLB System Data Register -------- */

typedef union
{
  struct
  {
    uint32_t SD0:8;                     /**< bit:   0..7  System Data (Byte 0)                          */
    uint32_t SD1:8;                     /**< bit:  8..15  System Data (Byte 1)                          */
    uint32_t SD2:8;                     /**< bit: 16..23  System Data (Byte 2)                          */
    uint32_t SD3:8;                     /**< bit: 24..31  System Data (Byte 3)                          */
  };
  uint32_t w;
} __MLB_MSD_bits_t;

#define MLB_MSD_SD0_Pos                       (0)                                            /**< (MLB_MSD) System Data (Byte 0) Position */
#define MLB_MSD_SD0_Msk                       (0xFFU << MLB_MSD_SD0_Pos)                     /**< (MLB_MSD) System Data (Byte 0) Mask */
#define MLB_MSD_SD0(value)                    (MLB_MSD_SD0_Msk & ((value) << MLB_MSD_SD0_Pos))
#define MLB_MSD_SD1_Pos                       (8)                                            /**< (MLB_MSD) System Data (Byte 1) Position */
#define MLB_MSD_SD1_Msk                       (0xFFU << MLB_MSD_SD1_Pos)                     /**< (MLB_MSD) System Data (Byte 1) Mask */
#define MLB_MSD_SD1(value)                    (MLB_MSD_SD1_Msk & ((value) << MLB_MSD_SD1_Pos))
#define MLB_MSD_SD2_Pos                       (16)                                           /**< (MLB_MSD) System Data (Byte 2) Position */
#define MLB_MSD_SD2_Msk                       (0xFFU << MLB_MSD_SD2_Pos)                     /**< (MLB_MSD) System Data (Byte 2) Mask */
#define MLB_MSD_SD2(value)                    (MLB_MSD_SD2_Msk & ((value) << MLB_MSD_SD2_Pos))
#define MLB_MSD_SD3_Pos                       (24)                                           /**< (MLB_MSD) System Data (Byte 3) Position */
#define MLB_MSD_SD3_Msk                       (0xFFU << MLB_MSD_SD3_Pos)                     /**< (MLB_MSD) System Data (Byte 3) Mask */
#define MLB_MSD_SD3(value)                    (MLB_MSD_SD3_Msk & ((value) << MLB_MSD_SD3_Pos))
#define MLB_MSD_Msk                           (0xFFFFFFFFUL)                                 /**< (MLB_MSD) Register Mask  */

/* -------- MLB_MIEN : (MLB Offset: 0x2c) (R/W 32) MediaLB Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t ISOC_PE:1;                 /**< bit:      0  Isochronous Rx Protocol Error Enable          */
    uint32_t ISOC_BUFO:1;               /**< bit:      1  Isochronous Rx Buffer Overflow Enable         */
    uint32_t :14;                       /**< bit:  2..15  Reserved                                      */
    uint32_t SYNC_PE:1;                 /**< bit:     16  Synchronous Protocol Error Enable             */
    uint32_t ARX_DONE:1;                /**< bit:     17  Asynchronous Rx Done Enable                   */
    uint32_t ARX_PE:1;                  /**< bit:     18  Asynchronous Rx Protocol Error Enable         */
    uint32_t ARX_BREAK:1;               /**< bit:     19  Asynchronous Rx Break Enable                  */
    uint32_t ATX_DONE:1;                /**< bit:     20  Asynchronous Tx Packet Done Enable            */
    uint32_t ATX_PE:1;                  /**< bit:     21  Asynchronous Tx Protocol Error Enable         */
    uint32_t ATX_BREAK:1;               /**< bit:     22  Asynchronous Tx Break Enable                  */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t CRX_DONE:1;                /**< bit:     24  Control Rx Packet Done Enable                 */
    uint32_t CRX_PE:1;                  /**< bit:     25  Control Rx Protocol Error Enable              */
    uint32_t CRX_BREAK:1;               /**< bit:     26  Control Rx Break Enable                       */
    uint32_t CTX_DONE:1;                /**< bit:     27  Control Tx Packet Done Enable                 */
    uint32_t CTX_PE:1;                  /**< bit:     28  Control Tx Protocol Error Enable              */
    uint32_t CTX_BREAK:1;               /**< bit:     29  Control Tx Break Enable                       */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __MLB_MIEN_bits_t;

