zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mlb.h
#define MLB_MIEN_ISOC_PE_Pos                  (0)                                            /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ISOC_PE_Msk                  (0x1U << MLB_MIEN_ISOC_PE_Pos)                 /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ISOC_BUFO_Pos                (1)                                            /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Position */
#define MLB_MIEN_ISOC_BUFO_Msk                (0x1U << MLB_MIEN_ISOC_BUFO_Pos)               /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Mask */
#define MLB_MIEN_SYNC_PE_Pos                  (16)                                           /**< (MLB_MIEN) Synchronous Protocol Error Enable Position */
#define MLB_MIEN_SYNC_PE_Msk                  (0x1U << MLB_MIEN_SYNC_PE_Pos)                 /**< (MLB_MIEN) Synchronous Protocol Error Enable Mask */
#define MLB_MIEN_ARX_DONE_Pos                 (17)                                           /**< (MLB_MIEN) Asynchronous Rx Done Enable Position */
#define MLB_MIEN_ARX_DONE_Msk                 (0x1U << MLB_MIEN_ARX_DONE_Pos)                /**< (MLB_MIEN) Asynchronous Rx Done Enable Mask */
#define MLB_MIEN_ARX_PE_Pos                   (18)                                           /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ARX_PE_Msk                   (0x1U << MLB_MIEN_ARX_PE_Pos)                  /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ARX_BREAK_Pos                (19)                                           /**< (MLB_MIEN) Asynchronous Rx Break Enable Position */
#define MLB_MIEN_ARX_BREAK_Msk                (0x1U << MLB_MIEN_ARX_BREAK_Pos)               /**< (MLB_MIEN) Asynchronous Rx Break Enable Mask */
#define MLB_MIEN_ATX_DONE_Pos                 (20)                                           /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Position */
#define MLB_MIEN_ATX_DONE_Msk                 (0x1U << MLB_MIEN_ATX_DONE_Pos)                /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Mask */
#define MLB_MIEN_ATX_PE_Pos                   (21)                                           /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Position */
#define MLB_MIEN_ATX_PE_Msk                   (0x1U << MLB_MIEN_ATX_PE_Pos)                  /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Mask */
#define MLB_MIEN_ATX_BREAK_Pos                (22)                                           /**< (MLB_MIEN) Asynchronous Tx Break Enable Position */
#define MLB_MIEN_ATX_BREAK_Msk                (0x1U << MLB_MIEN_ATX_BREAK_Pos)               /**< (MLB_MIEN) Asynchronous Tx Break Enable Mask */
#define MLB_MIEN_CRX_DONE_Pos                 (24)                                           /**< (MLB_MIEN) Control Rx Packet Done Enable Position */
#define MLB_MIEN_CRX_DONE_Msk                 (0x1U << MLB_MIEN_CRX_DONE_Pos)                /**< (MLB_MIEN) Control Rx Packet Done Enable Mask */
#define MLB_MIEN_CRX_PE_Pos                   (25)                                           /**< (MLB_MIEN) Control Rx Protocol Error Enable Position */
#define MLB_MIEN_CRX_PE_Msk                   (0x1U << MLB_MIEN_CRX_PE_Pos)                  /**< (MLB_MIEN) Control Rx Protocol Error Enable Mask */
#define MLB_MIEN_CRX_BREAK_Pos                (26)                                           /**< (MLB_MIEN) Control Rx Break Enable Position */
#define MLB_MIEN_CRX_BREAK_Msk                (0x1U << MLB_MIEN_CRX_BREAK_Pos)               /**< (MLB_MIEN) Control Rx Break Enable Mask */
#define MLB_MIEN_CTX_DONE_Pos                 (27)                                           /**< (MLB_MIEN) Control Tx Packet Done Enable Position */
#define MLB_MIEN_CTX_DONE_Msk                 (0x1U << MLB_MIEN_CTX_DONE_Pos)                /**< (MLB_MIEN) Control Tx Packet Done Enable Mask */
#define MLB_MIEN_CTX_PE_Pos                   (28)                                           /**< (MLB_MIEN) Control Tx Protocol Error Enable Position */
#define MLB_MIEN_CTX_PE_Msk                   (0x1U << MLB_MIEN_CTX_PE_Pos)                  /**< (MLB_MIEN) Control Tx Protocol Error Enable Mask */
#define MLB_MIEN_CTX_BREAK_Pos                (29)                                           /**< (MLB_MIEN) Control Tx Break Enable Position */
#define MLB_MIEN_CTX_BREAK_Msk                (0x1U << MLB_MIEN_CTX_BREAK_Pos)               /**< (MLB_MIEN) Control Tx Break Enable Mask */
#define MLB_MIEN_Msk                          (0x3F7F0003UL)                                 /**< (MLB_MIEN) Register Mask  */

/* -------- MLB_MLBC1 : (MLB Offset: 0x3c) (R/W 32) MediaLB Control 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LOCK:1;                    /**< bit:      6  MediaLB Lock Error Status (cleared by writing a 0) */
    uint32_t CLKM:1;                    /**< bit:      7  MediaLB Clock Missing Status (cleared by writing a 0) */
    uint32_t NDA:8;                     /**< bit:  8..15  Node Device Address                           */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __MLB_MLBC1_bits_t;

#define MLB_MLBC1_LOCK_Pos                    (6)                                            /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Position */
#define MLB_MLBC1_LOCK_Msk                    (0x1U << MLB_MLBC1_LOCK_Pos)                   /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_CLKM_Pos                    (7)                                            /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Position */
#define MLB_MLBC1_CLKM_Msk                    (0x1U << MLB_MLBC1_CLKM_Pos)                   /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_NDA_Pos                     (8)                                            /**< (MLB_MLBC1) Node Device Address Position */
#define MLB_MLBC1_NDA_Msk                     (0xFFU << MLB_MLBC1_NDA_Pos)                   /**< (MLB_MLBC1) Node Device Address Mask */
#define MLB_MLBC1_NDA(value)                  (MLB_MLBC1_NDA_Msk & ((value) << MLB_MLBC1_NDA_Pos))
#define MLB_MLBC1_Msk                         (0x0000FFC0UL)                                 /**< (MLB_MLBC1) Register Mask  */

