zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mlb.h
/* -------- MLB_HCTL : (MLB Offset: 0x80) (R/W 32) HBI Control Register -------- */

typedef union
{
  struct
  {
    uint32_t RST0:1;                    /**< bit:      0  Address Generation Unit 0 Software Reset      */
    uint32_t RST1:1;                    /**< bit:      1  Address Generation Unit 1 Software Reset      */
    uint32_t :13;                       /**< bit:  2..14  Reserved                                      */
    uint32_t EN:1;                      /**< bit:     15  HBI Enable                                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  struct
  {
    uint32_t RST:2;                     /**< bit:   0..1  Address Generation Unit x Software Reset      */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __MLB_HCTL_bits_t;

#define MLB_HCTL_RST0_Pos                     (0)                                            /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Position */
#define MLB_HCTL_RST0_Msk                     (0x1U << MLB_HCTL_RST0_Pos)                    /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Mask */
#define MLB_HCTL_RST1_Pos                     (1)                                            /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Position */
#define MLB_HCTL_RST1_Msk                     (0x1U << MLB_HCTL_RST1_Pos)                    /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Mask */
#define MLB_HCTL_EN_Pos                       (15)                                           /**< (MLB_HCTL) HBI Enable Position */
#define MLB_HCTL_EN_Msk                       (0x1U << MLB_HCTL_EN_Pos)                      /**< (MLB_HCTL) HBI Enable Mask */
#define MLB_HCTL_Msk                          (0x00008003UL)                                 /**< (MLB_HCTL) Register Mask  */
#define MLB_HCTL_RST_Pos                      (0)                                            /**< (MLB_HCTL Position) Address Generation Unit x Software Reset */
#define MLB_HCTL_RST_Msk                      (0x3U << MLB_HCTL_RST_Pos)                     /**< (MLB_HCTL Mask) RST */
#define MLB_HCTL_RST(value)                   (MLB_HCTL_RST_Msk & ((value) << MLB_HCTL_RST_Pos))

/* -------- MLB_HCMR : (MLB Offset: 0x88) (R/W 32) HBI Channel Mask 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t CHM:32;                    /**< bit:  0..31  Bitwise Channel Mask Bit [31:0]               */
  };
  uint32_t w;
} __MLB_HCMR_bits_t;

#define MLB_HCMR_CHM_Pos                      (0)                                            /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Position */
#define MLB_HCMR_CHM_Msk                      (0xFFFFFFFFU << MLB_HCMR_CHM_Pos)              /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Mask */
#define MLB_HCMR_CHM(value)                   (MLB_HCMR_CHM_Msk & ((value) << MLB_HCMR_CHM_Pos))
#define MLB_HCMR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_HCMR) Register Mask  */

/* -------- MLB_HCER : (MLB Offset: 0x90) (R/ 32) HBI Channel Error 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t CERR:32;                   /**< bit:  0..31  Bitwise Channel Error Bit [31:0]              */
  };
  uint32_t w;
} __MLB_HCER_bits_t;

#define MLB_HCER_CERR_Pos                     (0)                                            /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Position */
#define MLB_HCER_CERR_Msk                     (0xFFFFFFFFU << MLB_HCER_CERR_Pos)             /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Mask */
#define MLB_HCER_CERR(value)                  (MLB_HCER_CERR_Msk & ((value) << MLB_HCER_CERR_Pos))
#define MLB_HCER_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_HCER) Register Mask  */

/* -------- MLB_HCBR : (MLB Offset: 0x98) (R/ 32) HBI Channel Busy 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t CHB:32;                    /**< bit:  0..31  Bitwise Channel Busy Bit [31:0]               */
  };
  uint32_t w;
} __MLB_HCBR_bits_t;

#define MLB_HCBR_CHB_Pos                      (0)                                            /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Position */
#define MLB_HCBR_CHB_Msk                      (0xFFFFFFFFU << MLB_HCBR_CHB_Pos)              /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Mask */
#define MLB_HCBR_CHB(value)                   (MLB_HCBR_CHB_Msk & ((value) << MLB_HCBR_CHB_Pos))
#define MLB_HCBR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_HCBR) Register Mask  */

/* -------- MLB_MDAT : (MLB Offset: 0xc0) (R/W 32) MIF Data 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t DATA:32;                   /**< bit:  0..31  CRT or DBR Data                               */
  };
  uint32_t w;
} __MLB_MDAT_bits_t;

#define MLB_MDAT_DATA_Pos                     (0)                                            /**< (MLB_MDAT) CRT or DBR Data Position */
#define MLB_MDAT_DATA_Msk                     (0xFFFFFFFFU << MLB_MDAT_DATA_Pos)             /**< (MLB_MDAT) CRT or DBR Data Mask */
#define MLB_MDAT_DATA(value)                  (MLB_MDAT_DATA_Msk & ((value) << MLB_MDAT_DATA_Pos))
#define MLB_MDAT_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_MDAT) Register Mask  */

/* -------- MLB_MDWE : (MLB Offset: 0xd0) (R/W 32) MIF Data Write Enable 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t MASK:32;                   /**< bit:  0..31  Bitwise Write Enable for CTR Data - bits[31:0] */
  };
  uint32_t w;
} __MLB_MDWE_bits_t;

#define MLB_MDWE_MASK_Pos                     (0)                                            /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Position */
#define MLB_MDWE_MASK_Msk                     (0xFFFFFFFFU << MLB_MDWE_MASK_Pos)             /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Mask */
#define MLB_MDWE_MASK(value)                  (MLB_MDWE_MASK_Msk & ((value) << MLB_MDWE_MASK_Pos))
#define MLB_MDWE_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_MDWE) Register Mask  */

/* -------- MLB_MCTL : (MLB Offset: 0xe0) (R/W 32) MIF Control Register -------- */

typedef union
{
  struct
  {
    uint32_t XCMP:1;                    /**< bit:      0  Transfer Complete (Write 0 to Clear)          */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __MLB_MCTL_bits_t;

#define MLB_MCTL_XCMP_Pos                     (0)                                            /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Position */
#define MLB_MCTL_XCMP_Msk                     (0x1U << MLB_MCTL_XCMP_Pos)                    /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Mask */
#define MLB_MCTL_Msk                          (0x00000001UL)                                 /**< (MLB_MCTL) Register Mask  */

/* -------- MLB_MADR : (MLB Offset: 0xe4) (R/W 32) MIF Address Register -------- */

typedef union
{
  struct
  {
    uint32_t ADDR:14;                   /**< bit:  0..13  CTR or DBR Address                            */
    uint32_t :16;                       /**< bit: 14..29  Reserved                                      */
    uint32_t TB:1;                      /**< bit:     30  Target Location Bit                           */
    uint32_t WNR:1;                     /**< bit:     31  Write-Not-Read Selection                      */
  };
  uint32_t w;
} __MLB_MADR_bits_t;

#define MLB_MADR_ADDR_Pos                     (0)                                            /**< (MLB_MADR) CTR or DBR Address Position */
#define MLB_MADR_ADDR_Msk                     (0x3FFFU << MLB_MADR_ADDR_Pos)                 /**< (MLB_MADR) CTR or DBR Address Mask */
#define MLB_MADR_ADDR(value)                  (MLB_MADR_ADDR_Msk & ((value) << MLB_MADR_ADDR_Pos))
#define MLB_MADR_TB_Pos                       (30)                                           /**< (MLB_MADR) Target Location Bit Position */
#define MLB_MADR_TB_Msk                       (0x1U << MLB_MADR_TB_Pos)                      /**< (MLB_MADR) Target Location Bit Mask */
#define   MLB_MADR_TB_CTR_Val                 (0x0U)                                         /**< (MLB_MADR) Selects CTR  */
#define   MLB_MADR_TB_DBR_Val                 (0x1U)                                         /**< (MLB_MADR) Selects DBR  */
#define MLB_MADR_TB_CTR                       (MLB_MADR_TB_CTR_Val << MLB_MADR_TB_Pos)       /**< (MLB_MADR) Selects CTR Position  */
#define MLB_MADR_TB_DBR                       (MLB_MADR_TB_DBR_Val << MLB_MADR_TB_Pos)       /**< (MLB_MADR) Selects DBR Position  */
#define MLB_MADR_WNR_Pos                      (31)                                           /**< (MLB_MADR) Write-Not-Read Selection Position */
#define MLB_MADR_WNR_Msk                      (0x1U << MLB_MADR_WNR_Pos)                     /**< (MLB_MADR) Write-Not-Read Selection Mask */
#define MLB_MADR_Msk                          (0xC0003FFFUL)                                 /**< (MLB_MADR) Register Mask  */

/* -------- MLB_ACTL : (MLB Offset: 0x3c0) (R/W 32) AHB Control Register -------- */

typedef union
{
  struct
  {
    uint32_t SCE:1;                     /**< bit:      0  Software Clear Enable                         */
    uint32_t SMX:1;                     /**< bit:      1  AHB Interrupt Mux Enable                      */
    uint32_t DMA_MODE:1;                /**< bit:      2  DMA Mode                                      */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t MPB:1;                     /**< bit:      4  DMA Packet Buffering Mode                     */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __MLB_ACTL_bits_t;

