zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/mlb.h
#define MLB_ACTL_SCE_Pos                      (0)                                            /**< (MLB_ACTL) Software Clear Enable Position */
#define MLB_ACTL_SCE_Msk                      (0x1U << MLB_ACTL_SCE_Pos)                     /**< (MLB_ACTL) Software Clear Enable Mask */
#define MLB_ACTL_SMX_Pos                      (1)                                            /**< (MLB_ACTL) AHB Interrupt Mux Enable Position */
#define MLB_ACTL_SMX_Msk                      (0x1U << MLB_ACTL_SMX_Pos)                     /**< (MLB_ACTL) AHB Interrupt Mux Enable Mask */
#define MLB_ACTL_DMA_MODE_Pos                 (2)                                            /**< (MLB_ACTL) DMA Mode Position */
#define MLB_ACTL_DMA_MODE_Msk                 (0x1U << MLB_ACTL_DMA_MODE_Pos)                /**< (MLB_ACTL) DMA Mode Mask */
#define MLB_ACTL_MPB_Pos                      (4)                                            /**< (MLB_ACTL) DMA Packet Buffering Mode Position */
#define MLB_ACTL_MPB_Msk                      (0x1U << MLB_ACTL_MPB_Pos)                     /**< (MLB_ACTL) DMA Packet Buffering Mode Mask */
#define   MLB_ACTL_MPB_SINGLE_PACKET_Val      (0x0U)                                         /**< (MLB_ACTL) Single-packet mode  */
#define   MLB_ACTL_MPB_MULTIPLE_PACKET_Val    (0x1U)                                         /**< (MLB_ACTL) Multiple-packet mode  */
#define MLB_ACTL_MPB_SINGLE_PACKET            (MLB_ACTL_MPB_SINGLE_PACKET_Val << MLB_ACTL_MPB_Pos)  /**< (MLB_ACTL) Single-packet mode Position  */
#define MLB_ACTL_MPB_MULTIPLE_PACKET          (MLB_ACTL_MPB_MULTIPLE_PACKET_Val << MLB_ACTL_MPB_Pos)  /**< (MLB_ACTL) Multiple-packet mode Position  */
#define MLB_ACTL_Msk                          (0x00000017UL)                                 /**< (MLB_ACTL) Register Mask  */

/* -------- MLB_ACSR : (MLB Offset: 0x3d0) (R/W 32) AHB Channel Status 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t CHS:32;                    /**< bit:  0..31  Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) */
  };
  uint32_t w;
} __MLB_ACSR_bits_t;

#define MLB_ACSR_CHS_Pos                      (0)                                            /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Position */
#define MLB_ACSR_CHS_Msk                      (0xFFFFFFFFU << MLB_ACSR_CHS_Pos)              /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Mask */
#define MLB_ACSR_CHS(value)                   (MLB_ACSR_CHS_Msk & ((value) << MLB_ACSR_CHS_Pos))
#define MLB_ACSR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_ACSR) Register Mask  */

/* -------- MLB_ACMR : (MLB Offset: 0x3d8) (R/W 32) AHB Channel Mask 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t CHM:32;                    /**< bit:  0..31  Bitwise Channel Mask Bits 31 to 0             */
  };
  uint32_t w;
} __MLB_ACMR_bits_t;

#define MLB_ACMR_CHM_Pos                      (0)                                            /**< (MLB_ACMR) Bitwise Channel Mask Bits 31 to 0 Position */
#define MLB_ACMR_CHM_Msk                      (0xFFFFFFFFU << MLB_ACMR_CHM_Pos)              /**< (MLB_ACMR) Bitwise Channel Mask Bits 31 to 0 Mask */
#define MLB_ACMR_CHM(value)                   (MLB_ACMR_CHM_Msk & ((value) << MLB_ACMR_CHM_Pos))
#define MLB_ACMR_Msk                          (0xFFFFFFFFUL)                                 /**< (MLB_ACMR) Register Mask  */

/** \brief MLB register offsets definitions */
#define MLB_MLBC0_OFFSET             (0x00)         /**< (MLB_MLBC0) MediaLB Control 0 Register Offset */
#define MLB_MS0_OFFSET               (0x0C)         /**< (MLB_MS0) MediaLB Channel Status 0 Register Offset */
#define MLB_MS1_OFFSET               (0x14)         /**< (MLB_MS1) MediaLB Channel Status1 Register Offset */
#define MLB_MSS_OFFSET               (0x20)         /**< (MLB_MSS) MediaLB System Status Register Offset */
#define MLB_MSD_OFFSET               (0x24)         /**< (MLB_MSD) MediaLB System Data Register Offset */
#define MLB_MIEN_OFFSET              (0x2C)         /**< (MLB_MIEN) MediaLB Interrupt Enable Register Offset */
#define MLB_MLBC1_OFFSET             (0x3C)         /**< (MLB_MLBC1) MediaLB Control 1 Register Offset */
#define MLB_HCTL_OFFSET              (0x80)         /**< (MLB_HCTL) HBI Control Register Offset */
#define MLB_HCMR_OFFSET              (0x88)         /**< (MLB_HCMR) HBI Channel Mask 0 Register 0 Offset */
#define MLB_HCER_OFFSET              (0x90)         /**< (MLB_HCER) HBI Channel Error 0 Register 0 Offset */
#define MLB_HCBR_OFFSET              (0x98)         /**< (MLB_HCBR) HBI Channel Busy 0 Register 0 Offset */
#define MLB_MDAT_OFFSET              (0xC0)         /**< (MLB_MDAT) MIF Data 0 Register 0 Offset */
#define MLB_MDWE_OFFSET              (0xD0)         /**< (MLB_MDWE) MIF Data Write Enable 0 Register 0 Offset */
#define MLB_MCTL_OFFSET              (0xE0)         /**< (MLB_MCTL) MIF Control Register Offset */
#define MLB_MADR_OFFSET              (0xE4)         /**< (MLB_MADR) MIF Address Register Offset */
#define MLB_ACTL_OFFSET              (0x3C0)        /**< (MLB_ACTL) AHB Control Register Offset */
#define MLB_ACSR_OFFSET              (0x3D0)        /**< (MLB_ACSR) AHB Channel Status 0 Register 0 Offset */
#define MLB_ACMR_OFFSET              (0x3D8)        /**< (MLB_ACMR) AHB Channel Mask 0 Register 0 Offset */

/** \brief MLB register API structure */
typedef struct
{
  __IO  __MLB_MLBC0_bits_t             MLB_MLBC0;     /**< Offset: 0x00 (R/W  32) MediaLB Control 0 Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  __MLB_MS0_bits_t               MLB_MS0;       /**< Offset: 0x0C (R/W  32) MediaLB Channel Status 0 Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  __MLB_MS1_bits_t               MLB_MS1;       /**< Offset: 0x14 (R/W  32) MediaLB Channel Status1 Register */
  __I   uint8_t                        Reserved3[0x08];
  __IO  __MLB_MSS_bits_t               MLB_MSS;       /**< Offset: 0x20 (R/W  32) MediaLB System Status Register */
  __I   __MLB_MSD_bits_t               MLB_MSD;       /**< Offset: 0x24 (R/   32) MediaLB System Data Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  __MLB_MIEN_bits_t              MLB_MIEN;      /**< Offset: 0x2C (R/W  32) MediaLB Interrupt Enable Register */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  __MLB_MLBC1_bits_t             MLB_MLBC1;     /**< Offset: 0x3C (R/W  32) MediaLB Control 1 Register */
  __I   uint8_t                        Reserved6[0x40];
  __IO  __MLB_HCTL_bits_t              MLB_HCTL;      /**< Offset: 0x80 (R/W  32) HBI Control Register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  __MLB_HCMR_bits_t              MLB_HCMR[2];   /**< Offset: 0x88 (R/W  32) HBI Channel Mask 0 Register 0 */
  __I   __MLB_HCER_bits_t              MLB_HCER[2];   /**< Offset: 0x90 (R/   32) HBI Channel Error 0 Register 0 */
  __I   __MLB_HCBR_bits_t              MLB_HCBR[2];   /**< Offset: 0x98 (R/   32) HBI Channel Busy 0 Register 0 */
  __I   uint8_t                        Reserved8[0x20];
  __IO  __MLB_MDAT_bits_t              MLB_MDAT[4];   /**< Offset: 0xC0 (R/W  32) MIF Data 0 Register 0 */
  __IO  __MLB_MDWE_bits_t              MLB_MDWE[4];   /**< Offset: 0xD0 (R/W  32) MIF Data Write Enable 0 Register 0 */
  __IO  __MLB_MCTL_bits_t              MLB_MCTL;      /**< Offset: 0xE0 (R/W  32) MIF Control Register */
  __IO  __MLB_MADR_bits_t              MLB_MADR;      /**< Offset: 0xE4 (R/W  32) MIF Address Register */
  __I   uint8_t                        Reserved9[0x2D8];
  __IO  __MLB_ACTL_bits_t              MLB_ACTL;      /**< Offset: 0x3C0 (R/W  32) AHB Control Register */
  __I   uint8_t                        Reserved10[0x0C];
  __IO  __MLB_ACSR_bits_t              MLB_ACSR[2];   /**< Offset: 0x3D0 (R/W  32) AHB Channel Status 0 Register 0 */
  __IO  __MLB_ACMR_bits_t              MLB_ACMR[2];   /**< Offset: 0x3D8 (R/W  32) AHB Channel Mask 0 Register 0 */
} mlb_registers_t;
/** @}  end of MediaLB */

#endif /* _PIC32CZ_CA70_MLB_COMPONENT_H_ */
